[
  {
    "introduction": "This section is designed to help you strengthen your knowledge of React Native and mobile app development. You’ll start with the fundamentals—learning about components, JSX, and basic styling to build simple UIs. As you progress, you’ll dive into state management, props, and navigation, understanding how to create interactive and dynamic app experiences. Finally, in the advanced topics, you’ll tackle animations, performance optimization, and integrating native modules, gaining the skills to build high-quality, production-ready apps.",
    "levels": [
      {
        "level": "First Fundamentals",
        "intro": "Start here to learn the essentials of React Native, focusing on building basic components and understanding the core concepts. This stage will get you comfortable with creating simple mobile UIs.",
        "QuizButtonText": "Let's get started!",
        "ScreenName": "RN_Fundamentals_quiz_question",
        "topics": [
          {
            "title": "Components & JSX",
            "description": "Learn the basics of building UI using components and JSX syntax."
          },
          {
            "title": "Props & State",
            "description": "Understand how to pass data and manage component memory."
          },
          {
            "title": "Styling",
            "description": "Apply styles using React Native’s styling system."
          },
          {
            "title": "Basic Layouts",
            "description": "Arrange components with Flexbox for responsive design."
          },
          {
            "title": "Handling Events",
            "description": "Set up user interactions like taps and gestures."
          }
        ]
      },
      {
        "level": "Gear Up!",
        "intro": "This category will help you expand your knowledge to create more dynamic, interactive, and organized apps. You’ll focus on managing data, navigating between screens, and handling more complex components.",
        "QuizButtonText": "Let's gear up!",
        "ScreenName": "RN_Intermediate_quiz_question",
        "topics": [
          {
            "title": "Navigation",
            "description": "Implement navigation between screens using React Navigation."
          },
          {
            "title": "State Management",
            "description": "Manage app state efficiently with Context API or libraries like Redux."
          },
          {
            "title": "API Integration",
            "description": "Fetch data from external sources and handle asynchronous operations."
          },
          {
            "title": "Forms & User Input",
            "description": "Work with inputs, forms, and validation."
          },
          {
            "title": "React Native CLI",
            "description": "Familiarize yourself with the command-line interface for better control."
          }
        ]
      },
      {
        "level": "Full throttle",
        "intro": "At this level, you’ll explore features for building polished, high-performance apps. Expect to work with animations, native modules, and advanced optimization techniques.",
        "QuizButtonText": "Let's go!",
        "ScreenName": "RN_Advance_quiz_question",
        "topics": [
          {
            "title": "Animations",
            "description": "Create smooth animations using the Animated API or Reanimated."
          },
          {
            "title": "Performance Optimization",
            "description": "Techniques to improve rendering speed and reduce lag."
          },
          {
            "title": "Custom Native Modules",
            "description": "Integrate native code for extended functionality."
          },
          {
            "title": "Offline Functionality",
            "description": "Implement features like local storage and caching."
          },
          {
            "title": "Testing & Debugging",
            "description": "Ensure app stability with testing and debugging tools."
          }
        ]
      }
    ]
  }
]
